# Practice Questions:

1. Write a SQL lites statement to create a table names as employees including columns
employee_id, first_name, last_name, email, phone_numberhire_date, job_id, salary,
commission, manager_id and department_id
i) Insert values in the table and also execute the table structure
ii) Display the first name, last name of an employees whose salary is greater than 25,000

In [ ]:
CREATE DATABASE Task;

USE Task;

CREATE TABLE employees
(employee_id int auto_increment, 
first_name char(100),
last_name char(100), 
email varchar(100), 
phone_number varchar(100), 
hire_date varchar(100), 
job_id int, 
salary int,
commission int,
manager_id int,
department_id int,
PRIMARY KEY(employee_id));

TRUNCATE TABLE employees;

ALTER TABLE employees
MODIFY COLUMN hire_date date;

INSERT INTO employees(first_name, last_name, email, phone_number, hire_date, job_id, salary, commission, manager_id, department_id)
VALUES ('Aditya', 'Udaya', 'ap@gmail.com', 457851224, '10-10-10', 1, 100000, 94564, 2, 1),
('Arun', 'Jangra', 'aj@gmail.com', 515451215, '11-11-11', 6, 10000, 654846, 4, 2),
('Sai', 'Kumar', 'sk@gmail.com', 84548454, '30-11-20', 4, 55541, 1000, 10, 11),
('Avinash', 'Bolla', 'ab@gmail.com', 876549854, '20-04-04', 8, 100040, 432164, 7, 8),
('Varma', 'Penmesta', 'vp@gmail.com', 78755884, '31-01-20', 10, 11646, 44654, 12, 21);

SELECT * FROM employees;

SELECT first_name, last_name FROM employees WHERE salary>25000;

2. Create a table for Student with the following fields (Reg_no,stud_name,sex, and create a
table Dept with the following fields(dept_no primary key, dept_name)
a. Insert sample records and do the following
b. Display the student reg_no,name and dept_name
c. Display the student names ending with „ka‟
d. Display all the female students name
e. Display the student names by descending order

In [ ]:
CREATE TABLE students(
reg_no varchar(100),
student_name char(100),
sex char(100));

CREATE TABLE department(
dept_no int, dept_name char(100));

INSERT INTO students()
VALUES ("RA16444684564", "Aditya", "male"),
("RA164446464654", "sanjuna", "female"),
("RA16444684564", "Dinesh", "male"),
("RA164446845854", "Arun", "male"),
("RA164446584545", "Sowmya", "male");

INSERT INTO department()
VALUES (1, "CSE"),
(2, "Mech"),
(3, "IT"),
(4, "Auto"),
(5, "Civil");

-- Not possible to merge the two columns as therse isn't any common column 

INSERT INTO students()
VALUES ("RA13115411254","Navika", "female");

SELECT student_name from students WHERE student_name LIKE '%ka';

SELECT student_name FROM students WHERE sex = 'female';

SELECT student_name FROM students ORDER BY student_name DESC;

# Graded

1. Create the below table and execute the insert, update and the below select statements.

i) Write a query to display the total number of recipes available with the description
“Chinese”
ii) Write a query to display the id, name of the recipes with chef_id &#39;BL000002&#39;. iii)
Write a query to display the description of the recipes whose name begins with &#39;P&#39;.

In [ ]:
CREATE TABLE recipes(
id int(11),
name varchar(100),
description text,
category_id int(11),
chef_id int(225),
created datetime);


SELECT COUNT(name) FROM recipes WHERE description= 'Chinese';

SELECT id, name FROM recipes WHERE chef_id='BL000002';